// написать программу , которая принимает на вход трехзначное число
// и на выходе выходит перевернутое число

int number = 157;
if (number > 99 && number < 1000)
{

}
else
{
    Console.WriteLine("Введено не трехзначное число");
}