// 43 Написать программу преобразования десятичного числа в двоичное

void Zadacha43()
{
    int number = 43;
    string result = Convert.ToString(number, 2);
    Console.WriteLine(result);
}
Zadacha43();